Repository: 84000/data-translation-memory
Catalog: toh199_84000-the-sutra-on-maitreya-s-birth-in-the-heaven-of-joy.tmx
Source language: bo
Languages: en

source: བྱམས་པའི་ཞབས་འབྲིང་བྱེད་འདོད་པར་ལྟ་བ་ནི།
en: The observances for those who wish to serve Maitreya are as follows:

source: ཡན་ལག་ལྔའི་ཁྲིམས་བརྒྱད་རྫོགས་པ། ལུས་སེམས་ཀྱི་བརྩོན་འགྲུས་རྒྱུན་མི་འཆད་པ།
en: perfect the observance of the eight precepts including the five requisites; be ceaseless in physical and mental diligence;

source: དགེ་བ་བཅུའི་ཆོས་ལ་སྤྱོད་པ།
en: practice the ten virtues;

source: བདེ་སྐྱིད་ཕུན་སུམ་ཚོགས་པར་འདོད་པ།
en: desire abundant happiness;

source: སེམས་རྩེ་གཅིག་ཏུ་དགའ་ལྡན་གྱི་གནས་སུ་སྐྱེ་བར་འདོད་པ་དེ་དག་ནི་ཡང་དག་པར་ལྟ་བ་ཞེས་བྱ་སྟེ། གཞན་དུ་ལྟ་བ་ནི།
en: and maintain a one-pointed desire to be reborn in the Heaven of Joy.

source: ལོག་པར་ལྟ་བ་ཞེས་བྱའོ། །དེ་ནས་ཨུ་པཱ་ལི་སྟན་ལས་ལངས་ཏེ། གོས་ཚགས་བཅོས་ནས། གདོང་དང་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ།
en: This is known as the right observance, while any other observance is known as a wrong observance.”

source: བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས། དགའ་ལྡན་གྱི་གནམ་དུ་དེ་ལྟ་བུའི་བདེ་སྐྱིད་ཕུན་སུམ་ཚོགས་པ་དེར། སྐྱེས་བུ་ཆེན་པོ་འདི་དུས་ཅི་ཙམ་དུ་འཛམ་བུའི་གླིང་ནས། ལྷའི་གནས་དེ་ལྟ་བུར་སྐྱེ་བར་འགྱུར།
en: Then Upāli rose from his seat, adjusted his robes, bowed his head, and asked the Blessed One, “Blessed One, as there is such sublime happiness in the Heaven of Joy, when will this great being be reborn from Jambudvīpa into that divine realm?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། དུས་འདི་ནས་ལོ་བཅུ་གཉིས་ལོན་ནས། དཔྱིད་ཟླ་འབྲིང་པོའི་ཚེས་བཅོ་ལྔའི་ཉི་མ་ལ།
en: The Blessed One replied, “Twelve years from now, on the fifteenth day of the second month of spring, Maitreya will return to the place where he took birth:

source: ཡུལ་བ་ར་ནི་ཀྲ་པ་ལིའི་གྲོང་ཁྱེར་ན་བྲམ་ཟེ་ཆེན་པོ་པ་པ་ལི་ཞེས་བྱ་བའི་ཁྱིམ་ནས་སྐྱེ་བ་བླངས་པའི་ས་ནས། སྐྱིལ་མོ་ཀྲུང་བཅས་ནས།
en: the household of the great Brahmin Bāvarī, in the village of Kapāli, in the region of Vārāṇasī.

source: ཏིང་ངེ་འཛིན་ལ་མཉམ་པར་བཞག་པ་བཞིན་དུ།
en: There he will sit in the lotus posture, as if he were resting in utter absorption.

source: ལུས་གསེར་གྱི་ཁ་དོག་དང་། འོད་ཟེར་དམར་པོ་ཉི་མ་བརྒྱ་སྟོང་བས་ལྷག །སྟེང་གི་དགའ་ལྡན་གྱི་གནམ་དུ།
en: His body’s golden luster and the red rays of light it emits will be brighter than a hundred thousand suns, reaching up to the Heaven of Joy above.

source: ལུས་ཀྱི་སྐུ་གདུང་ཡང་དཔེར་ན། གསེར་གྱི་གཟུགས་བཞིན་དུ། མི་གཡོ་མི་འགུལ་བར།
en: His physical remains will stay still and unmoving, like a golden statue.

source: ལུས་ཀྱི་འོད་ཟེར་གྱི་དཀྱིལ་འཁོར་གྱི་ནང་ནས། རྣམ་པར་ཐར་པ་གསུམ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་ཡི་གེ་གསལ་བར་སྟོན་ཏེ།
en: From the sphere of light that surrounds his body, the syllables of the threefold liberation and the perfection of insight will distinctly emerge.

source: དེ་ནས་ལྷ་མི་ཐམས་ཅད་རྗེས་སུ་འབྲང་ནས། རིན་པོ་ཆེ་སྐུ་གདུང་གི་མཆོད་རྟེན་ལ་མཆོད་ནས།
en: “Gods and humans will all be drawn there to worship the precious stūpa with his physical remains.

source: དེ་ནས་དགའ་ལྡན་གྱི་གནམ་དུ། རིན་པོ་ཆེ་སྣ་བདུན་གྱི་ཕོ་བྲང་ན་འདི་གཞལ་མེད་ཁང་སེང་གེའི་པད་མའི་སྟེང་དུ་སྐྱིལ་མོ་ཀྲུང་བཅས་ནས། ལུས་འཛམ་བུ་གསེར་གྱི་ཁ་དོག་བཞིན་དུ་རྫུས་ཏེ་སྐྱེས་ནས།
en: Maitreya will then be miraculously reborn in the Heaven of Joy, in that palace made of the seven precious substances. As he sits cross-legged on a lotus flower atop the lion throne within the palace, his body will shine like gold from the Jambū river.

source: སྐུ་ཆུར་དཔག་ཚད་བཅུ་དྲུག །མཚན་སུམ་ཅུ་རྩ་གཉིས། དཔེ་བྱད་བཟང་པོ་བརྒྱད་ཅུས་རྫོགས་པར་བརྒྱན་པ། དབུའི་ཐོར་ཚུགས་དང་ལྡན།
en: His body will be sixteen leagues tall and fully adorned with the thirty-two major marks and the eighty excellent minor marks.

source: དབུ་སྐྲ་བཻ་དཱུརྱའི་ཁ་དོག་དང་འདྲ་བ། ཤི་ཀྲ་བི་ལི་ཀྲ་དང་། མ་འདི་དང་། གྱེན་ཤུགས་ཀྱི་རིན་པོ་ཆེ་ས་ལྷའི་དབུ་རྒྱན་བརྒྱན་པ།
en: There will be a topknot on his head, and his hair will resemble the color of beryl. His divine crown will be adorned with jewels such as śakrābhilagna and kiṃśuka

source: རིན་པོ་ཆེ་ལྷའི་དབུ་རྒྱན་དེ་དག་ལ། བྱེ་བ་ཕྲག་བརྒྱའི་རིན་པོ་ཆེའི་ཁ་དོག་རེ་རེའི་ནང་ནས།
en: The gems in his divine crown will shine with the colors of a billion jewels.

source: སྤྲུལ་པའི་དེ་བཞིན་གཤེགས་པ་དཔག་ཏུ་མེད་པ་བརྒྱ་སྟོང་ཕྲག་ཁྲིའི་སྤྲུལ་པའི་བྱང་ཆུབ་སེམས་དཔའ་མང་པོས་ཞབས་འབྲིང་བྱས་པ།
en: In each of the colors there will be immeasurably many billions of emanated thus-gone ones, along with a multitude of emanated bodhisattvas who act as their servants.

source: དེ་ནས་ཞིང་ཁམས་གཞན་གྱི་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད། ཆོ་འཕྲུལ་བཅོ་བརྒྱད་སྟོན་ཅིང་། ལྷའི་དབུ་རྒྱན་གྱི་ནང་ན་ཡིད་ལ་སྨོན་པའི་རྗེས་སུ་འཐུན་པར་ལྷའི་དབུ་རྒྱན་གྱི་ནང་ན་གནས་སོ།
en: All the bodhisattvas from other pure lands will display the eighteen miracles and take up residence inside the divine crown as they wish.

source: །བྱམས་པའི་སྨིན་མཚམས་ནས་འོད་ཟེར་དཀར་པོ་བྱུང་སྟེ།
en: “White rays of light will then emerge from between Maitreya’s eyebrows.

source: འོད་ཟེར་དེ་དག་ལས། བརྒྱ་ཕྲག་གི་རིན་པོ་ཆེའི་ཁ་དོག་དང་ལྡན་པའི་མཚན་སུམ་ཅུ་རྩ་གཉིས།
en: The light will cause the thirty-two major marks to manifest in the colors of hundreds of jewels.

source: མཚན་རེ་རེའི་ནང་ནས་བྱེ་བ་ཕྲག་ལྔ་བརྒྱའི་རིན་པོ་ཆེའི་ཁ་དོག་དཔེ་བྱད་བཟང་པོ། དཔེ་བྱད་རེ་རེ་ལ་ཡང་།
en: Within each major mark will be the minor marks, which in turn will manifest in the colors of five billion jewels.

source: བྱེ་བ་ཕྲག་ལྔ་བརྒྱའི་རིན་པོ་ཆེའི་མཚན་དང་། དཔེ་བྱད་ཀྱི་ཁ་དོག་འབར་བའི་ལྷའི་བུ་རེ་རེའི་འོད་ཟེར་བརྒྱ་ཁྲི་བཞི་སྟོང་གི་སྤྲིན་ཐམས་ཅད་པད་མ་ལས་རང་རང་འདུག་ནས།
en: Also, within each minor mark, gods will manifest whose major and minor marks blaze in the colors of five billion gems.

source: ཉིན་མཚན་རྟག་པར་ཕྱིར་མི་ལྡོག་པའི་སའི་ཆོས་ཀྱི་འཁོར་ལོ་སྤྱོད་པ།
en: Each god will sit on a lotus within an orb of eighty-four thousand light rays. Maitreya will continuously turn the Dharma wheel of the nonregressing level, day and night.

source: བགྲོད་པ་གཅིག་ཅིང་དོན་གྲུབ་པར་བྱེད་པ་ཕྲག་ལྔ་བརྒྱའི་ལྷའི་བུ་དེ་དག་ཕྱིར་མི་ལྡོག་པའི། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་འདི་དག་ཏུ།
en: He will set these five billion gods toward a single destination, accomplish their aims, and make them nonregressing from unsurpassed and complete awakening.

source: དགའ་ལྡན་གྱི་གནམ་དུ་ཉིན་མཚན་རྟག་ཏུ་ཕྱིར་མི་ལྡོག་པའི་སའི་ཆོས་ཀྱི་འཁོར་ལོ་ལ། ལྷའི་བུ་ཐམས་ཅད་འཁོད་པ། འཛམ་བུའི་གླིང་གི་ཚེ་ལོའི་གྲངས་བྱེ་བ་འབུམ་ཕྲག་ལྔ་བཅུ་རྩ་དྲུག་ལོན་ནས། བྱམས་པ་དགའ་ལྡན་གྱི་གནམ་ནས་འཛམ་བུའི་གླིང་དུ་སྐྱེ་བ་བླངས་པའི་མདོ་བཤད་པར་འགྱུར་རོ། །ཨུ་པཱ་ལི།
en: Day and night within the Heaven of Joy, he will continuously establish all gods in the Dharma wheel of the nonregressing level. Then, after fifty-six trillion Jambudvīpa years, the discourse called Maitreya’s Birth from the Heaven of Joy into Jambudvīpa will be taught.

source: བྱང་ཆུབ་སེམས་དཔའ་བྱམས་པ་ཞེས་བྱ་བ། འཛམ་བུའི་གླིང་ནས་ཚེ་འཕོས་ནས། དགའ་ལྡན་གནམ་དུ་སྐྱེས་པའི་ཡོན་ཏན་ནི།
en: “Upāli, the qualities associated with the bodhisattva Maitreya passing away from this world and being reborn in the Heaven of Joy are as follows.

source: དེ་བཞིན་གཤེགས་པ་མྱ་ངན་ལས་འདས་ནས། ངའི་འཁོར་ཉེ་གནས་ལས་གང་ལ་ལ་ཞིག །བརྩོན་འགྲུས་སུ་བསོད་ནམས་བསགས་པ། སྡོམ་པ་མ་ཞིག་ཅིང་མཆོད་རྟེན་ལ་ཕྱག་དར་དང་། མཎྜལ་བྱེད་པ་དང་། སྤོས་དྲི་ཞིམ་པ་དང་། མེ་ཏོག་གི་མཆོད་པ་དང་། རྣམ་པར་ཐར་པ་གསུམ་ལ་སྤྱོད་ཅིང་། ཟབ་ཅིང་དྲང་བའི་ཆོས་ལ་སྤྱོད་པ་དང་། མདོ་སྡེ་ཀློག་ཅིང་། སེམས་རྩེ་གཅིག་ཏུ་རྒྱུན་མི་འཆད་པར་ཡིད་ལ་ཟློས་པ་དང་། མངོན་པར་ཤེས་པ་དྲུག་ཐོབ་པར་བྱེད་པ་དང་། དེ་བཞིན་གཤེགས་པའི་སྐུ་གཟུགས་བྱེད་པ་དང་། བྱམས་པའི་མཚན་བརྗོད་པ་དེ་ལྟ་བུ་ལ་སོགས་པའི་མི་དེ་དག་ནི་འདི་སྐད་ཅིག་ཙམ་དུ་ཁྲིམས་བརྒྱད་མནོས་ནས།
en: After the Thus-Gone One passes into nirvāṇa, some among my attendant retinue will diligently accumulate merit, maintain their vows, sweep stūpas, construct maṇḍalas, burn fragrant incense, offer flowers, practice the threefold liberation, practice the profound and true Dharma, recite the sūtras and continuously keep them single-pointedly in mind, acquire the six superknowledges, make statues of the thus-gone ones, recite the name of Maitreya, and other such things.

source: སྡིག་པ་ཐམས་ཅད་བྱང་བར་བྱེད་ཅིང་། སྨོན་ལམ་བཏབ་ནས། ཚེའི་དུས་བྱས་པའི་འོག་ཏུ། དཔེར་ན་སྐྱེས་བུ་སྟོབས་དང་ལྡན་པ་ལག་པ་བརྐྱང་བ་ཙམ་དུ་དགའ་ལྡན་དུ་སྐྱེས་ནས་པད་མའི་སྟེང་དུ་སྐྱིལ་མོ་ཀྲུང་བཅས་ནས།
en: When it comes time for them to pass away—after they have received the eight vows, purified all misdeeds, and made prayers—they will instantly be born in the Heaven of Joy, just as quickly as a strong man can stretch out his arm.

source: བརྒྱ་ཕྲག་སྟོང་གི་ལྷའི་བུས། ལྷའི་རོལ་མོ་བྱེད་ཅིང་། མེ་ཏོག་མན་དཱ་ར་བ་དང་། མན་དཱ་ར་བ་ཆེན་པོ་འཐོར་ཞིང་། ལེགས་སོ་ལེགས་སོ། །ཞེས་བསྔགས་པ་བརྗོད་ནས།
en: “Then they will sit cross-legged atop lotus flowers, as hundreds of thousands of gods play divine music, scatter mandārava and great mandārava flowers, and praise them, saying ‘Excellent!

source: རིགས་ཀྱི་བུ་ཁྱོད་ནི་འཛམ་བུའི་གླིང་དུ་བསོད་ནམས་རྒྱ་ཆེན་པོ་བསགས་ནས།
en: Excellent! Noble sons, you have accumulated vast merit in Jambudvīpa;

source: འཆི་འཕོ་བའི་འོག་ཏུ། འདི་ནི་དགའ་ལྡན་གྱི་གནས་ཞེས་བྱ་བ་ཡིན་ཏེ། འདིར་ལྷའི་རྒྱལ་པོ་བྱམས་པ་ཞེས་བྱ་བ་ལ།
en: and now, upon dying, you have arrived here in the Heaven of Joy.

source: ཁྱོད་སྐྱབས་སུ་གསོལ། ཕྱག་འཚོལ་ཅིག་དང་། ཕྱག་འཚལ་ན། སྨིན་མཚམས་ཀྱི་མཛོད་སྤུ་ནས། འོད་ཟེར་དཀར་པོ་རེག་པར་བྱས་ནས། བསྐལ་པ་དགུ་བཅུའི་སྐྱེ་ཤི་ལས་གྲོལ་ཞིང་སྡིག་པ་འབྱང་བར་འགྱུར་རོ། །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའི་རྗེས་སུ་འཐུན་པའི་ཡོན་ཏན་གྱིས།
en: You should request refuge from the divine king Maitreya and prostrate to him. When you prostrate to him, white light will emerge from the ūrṇā hair between his eyebrows and touch you, liberating you from ninety eons of birth and death and purifying your misdeeds.’

source: ངོ་མཚར་གྱི་ཆོས་བཤད་ནས། བརྩོན་པ་མི་འདོར་བ་ཕྱིར་མི་ལྡོག་པའི་འཁོར་ལོ་དང་། བླ་ན་མེད་པའི་ལམ་ཡིད་ལ་སེམས་པ་དེ་ལྟ་བུ་ལ་སོགས་པའི་སེམས་ཅན་སྡིག་པ་ཐམས་ཅད་བྱང་ཞིང་།
en: “Now that I have explained the marvelous Dharma of the benefits of affiliating oneself with this bodhisattva, sentient beings should not abandon their diligence, but should bring to mind the nonregressing Dharma wheel and the unsurpassed path.

source: ཆོས་དྲུག་ལ་སྤྱོད་ན། ཐེ་ཙོམ་མེད་པར་ངེས་པར་དགའ་ལྡན་གྱི་གནམ་དུ་སྐྱེས་ནས། འཕགས་པ་བྱམས་པའི་ཞལ་མཐོང་།
en: As they purify their misdeeds and engage in the six practices, they will undoubtedly be born in the Heaven of Joy and come face-to-face with the noble Maitreya.

source: བྱམས་པའི་ཞབས་འབྲིང་བྱས་ནས། འཛམ་བུའི་གླིང་དུ་དང་པོར་ཆོས་ཐོས་ནས།
en: Having entered into Maitreya’s service, they will then first hear his Dharma in Jambudvīpa.

source: མ་འོངས་པའི་བསྐལ་པ་འདི་ཉིད་ཀྱི་སངས་རྒྱས་དང་། བསྐལ་པ་སྐར་མ་ལྟ་བུའི་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ཡང་ཞལ་མཐོང་ནས།
en: They will come face-to-face with all the future buddhas of this present eon, as well as all the buddhas in as many other eons as there are stars in the sky.

source: སངས་རྒྱས་དེ་དག་ཐམས་ཅད་ཀྱི་དྲུང་དུ་བྱང་ཆུབ་ཏུ་ལུང་སྟོན་པ་ཐོབ་པར་འགྱུར་རོ།
en: In the presence of all those buddhas, they will receive prophecies of their own awakening.

source: །ཨུ་པཱ་ལི། དེ་བཞིན་གཤེགས་པ་མྱ་ངན་ལས་འདས་པའི་འོག་ཏུ། དགེ་སློང་དང་། དགེ་སློང་མ་དང་། ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མིའམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་ལ་སོགས་པ་འཁོར་ཐམས་ཅད་ལས། གང་ལ་ལ་ཞིག་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱམས་པའི་མཚན་ཐོས་ནས་དགའ་བ་དང་། གུས་པར་ཕྱག་འཚལ་བའི་མི་དེ་དག །ཚེའི་དུས་བྱས་ནས། སེ་གོལ་གཏོགས་པ་ཙམ་དུ་གོང་མ་ཅི་ལྟ་བ་བཞིན་དུ།
en: “Upāli, after the Thus-Gone One has passed into nirvāṇa, within all my retinues of monks, nuns, gods, nāgas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, and mahoragas, anyone who hears the name of the bodhisattva great being Maitreya and venerates him with joy and respect shall attain all that was just mentioned in the mere snap of a finger, once they pass away.

source: བྱམས་པའི་མཚན་ཐོས་ནས་ཚེའི་དུས་བྱས་པའི་འོག་ཏུ། མུན་པའི་ཁམས་སུ་མི་ལྟུང་། མཐའ་འཁོབ་ཀྱི་ཡུལ་དང་། ལོག་པར་ལྟ་བ་དང་། མི་དགེ་བ་ཐམས་ཅད་སྤྱོད་པར་མི་སྐྱེ།
en: Upon hearing Maitreya’s name, they will no longer fall into the realms of darkness upon death, nor will they be reborn in any outlying regions, nor among people with wrong views or nonvirtuous behaviors.

source: སྐྱེ་བ་ཐམས་ཅད་དུ་དྲང་པོར་ལྟ་བ་དང་། འཁོར་ཕུན་སུམ་ཚོགས་པ་དང་། དཀོན་མཆོག་གསུམ་ལ་མི་སྨོད་པར་སྐྱེའོ། །ཨུ་པཱ་ལི།
en: Such people will be reborn in every lifetime where the view is proper, the retinue is abundant, and the Three Jewels are never disgraced.

source: རིགས་ཀྱི་བུ་དང་། རིགས་ཀྱི་བུ་མོ་གང་ལ་ལ་ཞིག །སྡོམ་པ་བཤིག་པ་དང་། སྡིག་པ་མི་དགེ་བའི་ལས་བྱས་པས། བྱང་ཆུབ་སེམས་དཔའ་ཐུགས་རྗེ་ཆེན་པོའི་མཚན་ཐོས་པས། མཚན་ནས་བརྗོད་ཅིང་། ཡན་ལག་ལྔ་གཏུགས་ཏེ། སེམས་རྩེ་གཅིག་ཏུ་བཤགས་ན།
en: “Upāli, if those noble sons or daughters who have broken their vows or committed unwholesome misdeeds hear the name of the bodhisattva of great compassion, call out his name, place their full body on the ground, and confess with an undistracted mind, the entirety of their misdeeds will swiftly be purified.

source: སྡིག་པ་ཐམས་ཅད་མྱུར་དུ་བྱང་ནས་མ་འོངས་པའི་དུས་ཀྱི་སེམས་ཅན་ཐམས་ཅད། བྱང་ཆུབ་སེམས་དཔའ་ཐུགས་རྗེ་ཆེན་པོའི་མཚན་བརྗོད་པ་དང་། སྐུ་གཟུགས་བྲིས་ནས། སྤོས་དང་། མེ་ཏོག་དང་། གོས་དང་། གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་དང་། ཕྱག་འཚལ་ཞིང་། ཡིད་ལ་ཟློས་ན། མི་དེ་དག་ཚེའི་དུས་བྱས་པའི་ཚེ་ན། བྱང་ཆུབ་སེམས་དཔའ་བྱམས་པས། མི་ཆེན་པོའི་མཚན་སྨིན་མཚམས་ཀྱི་མཛོད་སྤུ་ནས། འོད་དང་། ལྷའི་བུ་ཐམས་ཅད་ཀྱིས། མན་དཱ་ར་བའི་ཆར་ཕབ་ནས། མི་དེ་དག་བསུས་ནས། སྐད་ཅིག་ཡུད་ཙམ་གྱིས་ལྷའི་གནས་སུ་སྐྱེས།
en: If anyone in the future speaks the name of the bodhisattva of great compassion, paints his image, offers him incense, flowers, fabrics, parasols, banners, or flags, venerates him, or recalls his name, then upon passing away, the bodhisattva Maitreya will radiate light from the ūrṇā hair between his eyebrows—one of the marks of a great being—and all the gods will send down a rain of mandārava flowers to welcome them as they are instantly reborn in the divine realm.

source: འཕགས་པ་བྱམས་པའི་ཞལ་མཐོང་ནས། གདོང་དང་སྤྱི་བོས་ཕྱག་འཚལ་ནས།
en: They will meet face-to-face with the noble Maitreya and bow their heads to him.

source: དེ་མ་ཐག་ཏུ་ཆོས་ཐོས་པ་དང་། བླ་ན་མེད་པའི་བྱང་ཆུབ་ཀྱི་ལམ་ཐོབ་པ་དང་། ཕྱིར་མི་ལྡོག་པའི་འཁོར་ལོ་དང་། མ་འོངས་པའི་དུས་ཀྱི་ཚེ།
en: At that very moment, they will hear the Dharma, attain the path of unsurpassed awakening, and obtain the nonregressing wheel of Dharma.

source: དེ་བཞིན་གཤེགས་པ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ཀྱི་དེ་བཞིན་གཤེགས་པ་མཐོང་བར་འགྱུར་རོ། །ཨུ་པཱ་ལི།
en: In future lives, they will behold as many thus-gone ones as there are grains of sand in the Ganges river.

source: ཁྱོད་རྩེ་གཅིག་ཏུ་ཉོན་ལ་ཡིད་ལ་གྱིས་ཤིག །བྱང་ཆུབ་སེམས་དཔའ་བྱམས་པ་ཞེས་བྱ་བ་ལ།
en: “Upāli, listen attentively and pay heed.

source: མ་འོངས་པའི་སེམས་ཅན་ཐམས་ཅད་སྐྱབས་སུ་འགྲོ་བ་ན། གང་ལ་ལ་ཞིག་སྐྱབས་སུ་འགྲོ་བའི་མི་དེ་དག་ནི། བླ་ན་མེད་པའི་ལམ་དང་། ཕྱིར་མི་ལྡོག་པའི་འཁོར་ལོ་འཐོབ་ནས། བྱང་ཆུབ་སེམས་དཔའ་བྱམས་པ།
en: When sentient beings in the future take refuge in the bodhisattva Maitreya, those who do so will attain the unsurpassed path and the nonregressing wheel of Dharma.

source: དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་པའི་དུས་ཀྱི་ཚེ། མི་དེ་དག་དེ་བཞིན་གཤེགས་པའི་འོད་ཟེར་མཐོང་ནས། ལུང་བསྟན་པ་ཐོབ་པར་འགྱུར་རོ།
en: Then, once the bodhisattva Maitreya attains the state of a thus-gone one, a worthy one, a perfect buddha, those people will see the light of that thus-gone one and receive a prophecy.

source: །ཨུ་པཱ་ལི། དེ་བཞིན་གཤེགས་པ་མྱ་ངན་ལས་འདས་པའི་འོག་ཏུ་འཁོར་བཞི་པོ་དང་། ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་ལ་སོགས་པ་གང་ལ་ལ་ཞིག་དགའ་ལྡན་གྱི་གནས་སུ་སྐྱེས་པའི་དུས་ཀྱི་ཚེ།
en: “Upāli, after the Thus-Gone One’s nirvāṇa, when the time comes for anyone—whether they are in the four retinues or a god, nāga, or yakṣa—to be reborn in the Heaven of Joy, then they must engage in the following contemplations: Thinking of the Heaven of Joy, they should take up the vows of the Thus-Gone One.

source: འདི་ལྟར་བལྟ་བར་བྱ་སྟེ། དགའ་ལྡན་ཡིད་ལ་བྱེད་པས། དེ་བཞིན་གཤེགས་པའི་སྡོམ་པ་བླངས་ནས། ཉི་མ་གཅིག་གམ། ཉི་མ་བདུན་གྱི་བར་དུ།
en: Then, whether for a single day or for up to seven days, they should contemplate the ten virtues and practice the path of the ten virtues.

source: དགེ་བ་བཅུ་ཡིད་ལ་བྱེད་པ་དང་། དགེ་བ་བཅུའི་ལམ་ལ་སྤྱོད་པའི་བསོད་ནམས་དེ་དག །བྱམས་པའི་མདུན་དུ་བསྔོ་ཞིང་སྨོན་ལམ་བཏབ་པ་དེ་དག་ནི།
en: Then the merit from this practice should be dedicated, and the aspiration made to be in the presence of Maitreya.

source: ལྟ་བ་དེ་དག་གི་ལྷའི་བུ་མཐོང་བ་དང་། པད་མ་མཐོང་བར་འགྱུར་རོ།
en: Those who carry out these contemplations will behold a god and a lotus.

source: །གང་ལ་ལ་ཞིག་སྐད་ཅིག་ཙམ་བྱམས་པའི་མིང་ནས་བརྗོད་པའི་མི་དེ་དག་ནི། བསྐལ་པ་སྟོང་ཉིས་བརྒྱའི་སྐྱེ་ཤི་ལས་གྲོལ་ཞིང་། སྡིག་པ་འབྱང་བར་འགྱུར་རོ།
en: Those who recite the name of Maitreya even once will be freed from twelve hundred eons of birth and death and will have their misdeeds purified.

source: །བྱམས་པའི་མཚན་ཐོས་པས་ཐལ་མོ་སྦྱར་བའི་མི་དེ་དག་ནི། བསྐལ་པ་ལྔ་བཅུའི་སྐྱེ་ཤི་ལས་ཐར་བར་འགྱུར་རོ།
en: Those who hear the name of Maitreya and join their palms together will be freed from fifty eons of birth and death.

source: །གང་ལ་ལ་ཞིག་བྱམས་པ་ལ་གུས་པར་ཕྱག་འཚལ་བས། བསྐལ་པ་བྱེ་བ་བརྒྱའི་སྐྱེ་ཤི་ལས་གྲོལ་ཐར་ཞིང་སྡིག་པ་བྱང་བར་འགྱུར་རོ།
en: Those who respectfully prostrate to Maitreya will be liberated from one billion eons of birth and death and will have their misdeeds purified.

source: །ལྷའི་གནས་ལ་མི་ཆགས་ཤིང་། མ་འོངས་པའི་དུས་སུ་ཀླུའི་སྡོང་པོ་བྱང་ཆུབ་ཀྱི་ཤིང་དྲུང་དུ། བླ་ན་མེད་པའི་བྱང་ཆུབ་ཀྱི་ལམ་དུ་སེམས་བསྐྱེད་པ་ཡང་ཐོབ་པར་འགྱུར་རོ།
en: They will not be attached to the heavenly realms, but will generate the mind set upon unsurpassed awakening in the future, under the bodhi tree, the tree of the nāgas.”

source: །དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་དང་། འཁོར་མང་པོ་དཔག་ཏུ་མེད་པ་སྟན་ལས་ལངས་ཏེ།
en: Then the immeasurably great retinue rose from their seats.

source: བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ནས། བྱམས་པའི་ཞབས་ལ་ཡང་ཕྱག་འཚལ་ནས།
en: They bowed their heads at the feet of the Blessed One, and then bowed at the feet of Maitreya.

source: བཅོམ་ལྡན་འདས་དང་། བྱམས་པ་ལ་ལན་བརྒྱ་སྟོང་དུ་བསྐོར་ནས།
en: They circled the Blessed One and Maitreya a hundred thousand times.

source: ལམ་མ་ཐོབ་པ་དག་རང་རང་གི་སྨོན་ལམ་བཏབ་པ།
en: Those who had not yet attained the path each made the following aspiration:

source: བདག་ཅག་ལ་སོགས་པས། ལྷ་དང་། མི་དང་། སྡེ་བརྒྱད་པོ་འདིར་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་མོས་པས་སྨོན་ལམ་བཏབ་པས། མ་འོངས་པའི་དུས་སུ་ལུས་སྤངས་ནས། འཕགས་པ་བྱམས་པའི་ཞལ་མཐོང་བ་དང་། ཐམས་ཅད་དགའ་ལྡན་གྱི་གནམ་དུ་སྐྱེ་བ་ཐོབ་པར་གྱུར་ཅིག །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: “By fervently making aspirations here in the presence of the Blessed One, may all of us—gods, humans, the eight classes of nonhuman beings, and so forth—in the future, having abandoned our bodies, behold noble Maitreya, and be reborn in the Heaven of Joy.”

source: ཁྱེད་ལ་སོགས་པ་མ་འོངས་པའི་དུས་སུ་བསོད་ནམས་བྱེད་པ་དང་། ཚུལ་ཁྲིམས་བསྲུང་བ་དང་། ཐམས་ཅད་བྱང་ཆུབ་སེམས་དཔའ་བྱམས་པའི་དྲུང་དུ་སྐྱེ་བ་བླངས་ནས།
en: Then the Blessed One said, “In the future, all of you will create merit, guard your discipline, and take birth in the presence of the bodhisattva Maitreya.

source: བྱང་ཆུབ་སེམས་དཔའ་བྱམས་པས་བྱིན་གྱིས་རློབ་པར་འགྱུར་རོ།
en: The bodhisattva Maitreya will then bless all of you.”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་ཨུ་པཱ་ལི་ལ་བཀའ་སྩལ་པ། ཨུ་པཱ་ལི་དེ་ལྟ་བུར་ལྟ་བ་ནི། ཡང་དག་པར་ལྟ་བ་ཞེས་བྱའོ།
en: The Blessed One then spoke to Upāli, “Upāli, if you have such a view, it is said to be right view.

source: །གཞན་དུ་ལྟ་བ་ནི།
en: Any other view would be a wrong view.”

source: ལོག་པར་ལྟ་བ་ཞེས་བྱའོ། །དེ་ནས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་སྟན་ལ་འདུག་པ་ལས་ལངས་ཏེ། པུས་མོ་བཙུགས་ནས་ཐལ་མོ་སྦྱར་ཏེ། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །ལེགས་སོ།
en: The venerable Ānanda then rose from his seat, knelt down, joined his palms, and addressed the Blessed One, “Excellent!

source: །བཅོམ་ལྡན་འདས། བྱམས་པའི་ཡོན་ཏན་ལེགས་པར་བཤད་དོ།
en: The Blessed One has wonderfully explained Maitreya’s qualities.

source: །མ་འོངས་པའི་དུས་ཀྱི་ཚེ། བསོད་ནམས་བྱེད་པའི་སེམས་ཅན་འབྲས་བུ་ཐོབ་པ་བདག་ཅག་གིས་ཐོབ་པར་འཚལ་བས།
en: In the future, we shall strive to become such beings who attain the results of creating such merit.

source: བཅོམ་ལྡན་འདས་ཆོས་ཀྱི་རྣམ་གྲངས་འདིའི་མཚན་ཅི་ལགས།
en: Therefore, Blessed One, what is the name of this Dharma discourse?

source: བདག་ཅག་གིས་ཅི་ལྟར་གཟུང་བར་བགྱི།
en: How should we retain it?”

source: བཅོམ་ལྡན་འདས་ཀྱིས། ཀུན་དགའ་བོ་ལ་བཀའ་སྩལ་པ། ཀུན་དགའ་བོ། །ཁྱོད་ཀྱིས་དེ་བཞིན་གཤེགས་པས་གསུངས་པ་མ་བརྗེད་པར་ཟུང་ལ།
en: The Blessed One replied, “Ānanda, you should retain what the Thus-Gone One has taught without forgetting anything.

source: མ་འོངས་པའི་དོན་དུ་ལྷའི་གནས་སུ་སྐྱེ་བའི་ལམ་འབྱེད་པ་དང་། བྱང་ཆུབ་ཀྱི་མཚན་དང་། དེ་བཞིན་གཤེགས་པའི་གདུང་རྒྱུན་མི་གཅོད་པས།
en: For the sake of future times, you shall reveal the path that leads to rebirth in the divine realms, disclose the marks of awakening, and prevent the lineage of the thus-gone ones from being interrupted.

source: མདོ་སྡེའི་མིང་། བྱང་ཆུབ་སེམས་དཔའ་བྱམས་པ་མྱ་ངན་ལས་འདས་པ་ཞེས་ཀྱང་བྱ།
en: This discourse shall be known as The Nirvāṇa of the Bodhisattva Maitreya

source: བྱང་ཆུབ་སེམས་དཔའ་བྱམས་པ་དགའ་ལྡན་གྱི་གནམ་དུ་སྐྱེ་བ་བླངས་ནས། བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ལ་བསྐུལ་བ་ཞེས་བྱ་བར་ཟུང་ཤིག །བཅོམ་ལྡན་འདས་ཀྱིས་དེ་སྐད་ཅེས་བཀའ་སྩལ་ནས།
en: It shall also be known as The Bodhisattva Maitreya’s Birth in the Heaven of Joy and Encouragement for the Seat of Awakening . You must retain it!”

source: ཞིང་ཁམས་གཞན་ནས་འོངས་པའི་བྱང་ཆུབ་སེམས་དཔའ་འབུམ་ཕྲག་བཅུ་བཞིའི་ལེའུ་བརྒྱན་པའི་ཏིང་ངེ་འཛིན་ཐོབ་པར་གྱུར་ཏོ། །ལྷའི་བུ་འབུམ་ཕྲག་བརྒྱད་ཀྱིས་བླ་ན་མེད་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ནས།
en: When the Blessed One said this, a million bodhisattvas who had arrived from other pure lands attained the śūraṃgama absorption. Eight hundred thousand gods generated the mind set upon unsurpassed awakening.

source: ཐམས་ཅད་ཀྱིས་བྱམས་པའི་རྗེས་སུ་འབྲང་ནས། འཛམ་བུའི་གླིང་དུ་སྐྱེ་བར་སྨོན་ལམ་བཏབ་བོ།
en: They all made the aspiration to follow Maitreya and be reborn in Jambudvīpa.

source: །བཅོམ་ལྡན་འདས་ཀྱིས་དེ་སྐད་ཅེས་བཀའ་སྩལ་ནས། འཁོར་བཞི་པོ་དང་། ལྷ་དང་། ཀླུ་ལ་སོགས་པ། སྡེ་བརྒྱད་པོ། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་ནས། ཐམས་ཅད་མངོན་པར་དགའ་སྟེ།
en: After the Blessed One had spoken, the four retinues, as well as the eight classes of nonhuman beings—gods, nāgas, and so forth—rejoiced in what the Blessed One had said.

source: བཅོམ་ལྡན་འདས་ལ་ཕྱག་འཚལ་ནས་ཕྱིར་དོང་ངོ་།
en: They bowed to the Blessed One and then departed. This completes “ The Noble Sūtra:

source: །འཕགས་པ་བྱང་ཆུབ་སེམས་དཔའ་བྱམས་པ་དགའ་ལྡན་གནམ་དུ་སྐྱེ་བ་བླངས་པའི་མདོ་རྫོགས་སོ།།
en: The Bodhisattva Maitreya’s Birth in the Heaven of Joy

source: །།ཞུ་བའི་ལོཙྪ་བ་བན་དེ་པ་བ་ཏོང་དང་། བན་དེ་ཤེས་རབ་སེང་གེས་རྒྱའི་དཔེ་ལས་བསྒྱུར།། །།
en: This was translated from a Chinese manuscript by the editor-translator Venerable Pabtong and Venerable Sherab Sengé.
